docs: 完成测试v0.3.0，并且完善文档
